
<template>


  <div class="box">
    <el-page-header @back="goBack" content=" "></el-page-header>

    <el-header style="font-size: 35px;font-family:新宋体">
      <dv-decoration-7 style="width:350px;height:20px;margin-left: 170px">人口流动数据<i class="el-icon-user-solid"></i></dv-decoration-7>
    </el-header>
    <dv-decoration-5  style="width:1000px;margin-left: 300px;height:30px;"  />
  <div class="box" ref="echartsMap">
  </div>
    <div class="select_btn">
    <div style="margin-top: -100px" >
      <span class="demonstration" style="margin-left: 1050px;font-size: 18px">人口流出（城市）</span>
      <span class="demonstration" style="margin-left: 30px;font-size: 18px">人口流入（城市）</span>
    <el-cascader popper-class="pc-sel-area-cascader"
        v-model="value1"
        :level="2"
        :options="options"
        @change="drawPopOut"
        popper-append-to-body=false
       style="margin-left:1050px ;color: #0A41C8;background: #0A41C8;border-color: #0A41C8;width: 150px;"></el-cascader>

      <el-cascader popper-class="pc-sel-area-cascader"
        v-model="value2"
        :options="options"
        :level="2"
        @change="drawPopIn"
        popper-append-to-body=false
        style="padding-top:0px;margin-left: 20px;border-color: #0A41C8;width: 150px"></el-cascader>
      </div></div>
    <dv-scroll-ranking-board :config="listConfig" style="width:450px;height:300px;margin-left: 1000px;margin-top: -380px" />
    <dv-border-box-11 :color="['blue', '#308691']" :title="title" :titleWidth="titleWidth"  style="width: 500px;height: 350px;margin-left: 980px ;margin-top: -340px">
    </dv-border-box-11>
    <dv-border-box-11 :color="['blue', '#308691']" :title="title_analysis" :titleWidth="titleWidth"  style="width: 500px;height: 120px;margin-left: 980px ;margin-top: -460px">

      <div style="padding-top:55px;padding-left: 20px">{{this.analysis}}
      </div>
    </dv-border-box-11>

  </div>


</template>
<script>
import router from "../router";

const echarts = require("echarts");
//   import '../../node_modules/echarts/map/js/world.js'
import "../../node_modules/echarts/map/js/china.js"; // 引入中国地图数据
export default {
  name: "echartsMap",
  data() {
        return {
          title_analysis:"人口流入分析",
          ops: {
            vuescroll: {},
            scrollPanel: {},
            rail: {
              background: '#b1bcff',
              opacity: 0,
              size: '10px',
              specifyBorderRadius: false, //轨道距 x 和 y 轴两端的距离
              gutterOfSide: '0',   //距离容器的距离
              keepShow: false,   //是否即使 bar 不存在的情况下也保持显示
              border: 'none',  //边框
              padding: true
            }
          },
          analysis:"暂无信息",
          title:"北京市人口流出top10",
          titleWidth:300,
          myChart:{},
          value1:[110000,110000],
          value2:0,
          chart: null,
          listConfig:{data:[]},
          bjData:[],
          dataProvince : [],
      options: [{'value': 110000, 'label': '北京市', 'children': [{'value': 110000, 'label': '北京市'}]}, {'value': 120000, 'label': '天津市', 'children': [{'value': 120000, 'label': '天津市'}]}, {'value': 130000, 'label': '河北省', 'children': [{'value': 130100, 'label': '石家庄市'}, {'value': 130200, 'label': '唐山市'}, {'value': 130300, 'label': '秦皇岛市'}, {'value': 130400, 'label': '邯郸市'}, {'value': 130500, 'label': '邢台市'}, {'value': 130600, 'label': '保定市'}, {'value': 130700, 'label': '张家口市'}, {'value': 130800, 'label': '承德市'}, {'value': 130900, 'label': '沧州市'}, {'value': 131000, 'label': '廊坊市'}, {'value': 131100, 'label': '衡水市'}]}, {'value': 140000, 'label': '山西省', 'children': [{'value': 140100, 'label': '太原市'}, {'value': 140200, 'label': '大同市'}, {'value': 140300, 'label': '阳泉市'}, {'value': 140400, 'label': '长治市'}, {'value': 140500, 'label': '晋城市'}, {'value': 140600, 'label': '朔州市'}, {'value': 140700, 'label': '晋中市'}, {'value': 140800, 'label': '运城市'}, {'value': 140900, 'label': '忻州市'}, {'value': 141000, 'label': '临汾市'}, {'value': 141100, 'label': '吕梁市'}]}, {'value': 150000, 'label': '内蒙古自治区', 'children': [{'value': 150100, 'label': '呼和浩特市'}, {'value': 150200, 'label': '包头市'}, {'value': 150300, 'label': '乌海市'}, {'value': 150400, 'label': '赤峰市'}, {'value': 150500, 'label': '通辽市'}, {'value': 150600, 'label': '鄂尔多斯市'}, {'value': 150700, 'label': '呼伦贝尔市'}, {'value': 150800, 'label': '巴彦淖尔市'}, {'value': 150900, 'label': '乌兰察布市'}, {'value': 152200, 'label': '兴安盟'}, {'value': 152500, 'label': '锡林郭勒盟'}, {'value': 152900, 'label': '阿拉善盟'}]}, {'value': 210000, 'label': '辽宁省', 'children': [{'value': 210100, 'label': '沈阳市'}, {'value': 210200, 'label': '大连市'}, {'value': 210300, 'label': '鞍山市'}, {'value': 210400, 'label': '抚顺市'}, {'value': 210500, 'label': '本溪市'}, {'value': 210600, 'label': '丹东市'}, {'value': 210700, 'label': '锦州市'}, {'value': 210800, 'label': '营口市'}, {'value': 210900, 'label': '阜新市'}, {'value': 211000, 'label': '辽阳市'}, {'value': 211100, 'label': '盘锦市'}, {'value': 211200, 'label': '铁岭市'}, {'value': 211300, 'label': '朝阳市'}, {'value': 211400, 'label': '葫芦岛市'}]}, {'value': 220000, 'label': '吉林省', 'children': [{'value': 220100, 'label': '长春市'}, {'value': 220200, 'label': '吉林市'}, {'value': 220300, 'label': '四平市'}, {'value': 220400, 'label': '辽源市'}, {'value': 220500, 'label': '通化市'}, {'value': 220600, 'label': '白山市'}, {'value': 220700, 'label': '松原市'}, {'value': 220800, 'label': '白城市'}, {'value': 222400, 'label': '延边朝鲜族自治州'}]}, {'value': 230000, 'label': '黑龙江省', 'children': [{'value': 230100, 'label': '哈尔滨市'}, {'value': 230200, 'label': '齐齐哈尔市'}, {'value': 230300, 'label': '鸡西市'}, {'value': 230400, 'label': '鹤岗市'}, {'value': 230500, 'label': '双鸭山市'}, {'value': 230600, 'label': '大庆市'}, {'value': 230700, 'label': '伊春市'}, {'value': 230800, 'label': '佳木斯市'}, {'value': 230900, 'label': '七台河市'}, {'value': 231000, 'label': '牡丹江市'}, {'value': 231100, 'label': '黑河市'}, {'value': 231200, 'label': '绥化市'}, {'value': 232700, 'label': '大兴安岭地区'}]}, {'value': 310000, 'label': '上海市', 'children': [{'value': 310000, 'label': '上海市'}]}, {'value': 320000, 'label': '江苏省', 'children': [{'value': 320100, 'label': '南京市'}, {'value': 320200, 'label': '无锡市'}, {'value': 320300, 'label': '徐州市'}, {'value': 320400, 'label': '常州市'}, {'value': 320500, 'label': '苏州市'}, {'value': 320600, 'label': '南通市'}, {'value': 320700, 'label': '连云港市'}, {'value': 320800, 'label': '淮安市'}, {'value': 320900, 'label': '盐城市'}, {'value': 321000, 'label': '扬州市'}, {'value': 321100, 'label': '镇江市'}, {'value': 321200, 'label': '泰州市'}, {'value': 321300, 'label': '宿迁市'}]}, {'value': 330000, 'label': '浙江省', 'children': [{'value': 330100, 'label': '杭州市'}, {'value': 330200, 'label': '宁波市'}, {'value': 330300, 'label': '温州市'}, {'value': 330400, 'label': '嘉兴市'}, {'value': 330500, 'label': '湖州市'}, {'value': 330600, 'label': '绍兴市'}, {'value': 330700, 'label': '金华市'}, {'value': 330800, 'label': '衢州市'}, {'value': 330900, 'label': '舟山市'}, {'value': 331000, 'label': '台州市'}, {'value': 331100, 'label': '丽水市'}]}, {'value': 340000, 'label': '安徽省', 'children': [{'value': 340100, 'label': '合肥市'}, {'value': 340200, 'label': '芜湖市'}, {'value': 340300, 'label': '蚌埠市'}, {'value': 340400, 'label': '淮南市'}, {'value': 340500, 'label': '马鞍山市'}, {'value': 340600, 'label': '淮北市'}, {'value': 340700, 'label': '铜陵市'}, {'value': 340800, 'label': '安庆市'}, {'value': 341000, 'label': '黄山市'}, {'value': 341100, 'label': '滁州市'}, {'value': 341200, 'label': '阜阳市'}, {'value': 341300, 'label': '宿州市'}, {'value': 341500, 'label': '六安市'}, {'value': 341600, 'label': '亳州市'}, {'value': 341700, 'label': '池州市'}, {'value': 341800, 'label': '宣城市'}]}, {'value': 350000, 'label': '福建省', 'children': [{'value': 350100, 'label': '福州市'}, {'value': 350200, 'label': '厦门市'}, {'value': 350300, 'label': '莆田市'}, {'value': 350400, 'label': '三明市'}, {'value': 350500, 'label': '泉州市'}, {'value': 350600, 'label': '漳州市'}, {'value': 350700, 'label': '南平市'}, {'value': 350800, 'label': '龙岩市'}, {'value': 350900, 'label': '宁德市'}]}, {'value': 360000, 'label': '江西省', 'children': [{'value': 360100, 'label': '南昌市'}, {'value': 360200, 'label': '景德镇市'}, {'value': 360300, 'label': '萍乡市'}, {'value': 360400, 'label': '九江市'}, {'value': 360500, 'label': '新余市'}, {'value': 360600, 'label': '鹰潭市'}, {'value': 360700, 'label': '赣州市'}, {'value': 360800, 'label': '吉安市'}, {'value': 360900, 'label': '宜春市'}, {'value': 361000, 'label': '抚州市'}, {'value': 361100, 'label': '上饶市'}]}, {'value': 370000, 'label': '山东省', 'children': [{'value': 370100, 'label': '济南市'}, {'value': 370200, 'label': '青岛市'}, {'value': 370300, 'label': '淄博市'}, {'value': 370400, 'label': '枣庄市'}, {'value': 370500, 'label': '东营市'}, {'value': 370600, 'label': '烟台市'}, {'value': 370700, 'label': '潍坊市'}, {'value': 370800, 'label': '济宁市'}, {'value': 370900, 'label': '泰安市'}, {'value': 371000, 'label': '威海市'}, {'value': 371100, 'label': '日照市'}, {'value': 371300, 'label': '临沂市'}, {'value': 371400, 'label': '德州市'}, {'value': 371500, 'label': '聊城市'}, {'value': 371600, 'label': '滨州市'}, {'value': 371700, 'label': '菏泽市'}]}, {'value': 410000, 'label': '河南省', 'children': [{'value': 410100, 'label': '郑州市'}, {'value': 410200, 'label': '开封市'}, {'value': 410300, 'label': '洛阳市'}, {'value': 410400, 'label': '平顶山市'}, {'value': 410500, 'label': '安阳市'}, {'value': 410600, 'label': '鹤壁市'}, {'value': 410700, 'label': '新乡市'}, {'value': 410800, 'label': '焦作市'}, {'value': 410900, 'label': '濮阳市'}, {'value': 411000, 'label': '许昌市'}, {'value': 411100, 'label': '漯河市'}, {'value': 411200, 'label': '三门峡市'}, {'value': 411300, 'label': '南阳市'}, {'value': 411400, 'label': '商丘市'}, {'value': 411500, 'label': '信阳市'}, {'value': 411600, 'label': '周口市'}, {'value': 411700, 'label': '驻马店市'}, {'value': 419001, 'label': '济源市'}]}, {'value': 420000, 'label': '湖北省', 'children': [{'value': 420100, 'label': '武汉市'}, {'value': 420200, 'label': '黄石市'}, {'value': 420300, 'label': '十堰市'}, {'value': 420500, 'label': '宜昌市'}, {'value': 420600, 'label': '襄阳市'}, {'value': 420700, 'label': '鄂州市'}, {'value': 420800, 'label': '荆门市'}, {'value': 420900, 'label': '孝感市'}, {'value': 421000, 'label': '荆州市'}, {'value': 421100, 'label': '黄冈市'}, {'value': 421200, 'label': '咸宁市'}, {'value': 421300, 'label': '随州市'}, {'value': 422800, 'label': '恩施土家族苗族自治州'}, {'value': 429004, 'label': '仙桃市'}, {'value': 429005, 'label': '潜江市'}, {'value': 429006, 'label': '天门市'}, {'value': 429021, 'label': '神农架林区'}]}, {'value': 430000, 'label': '湖南省', 'children': [{'value': 430100, 'label': '长沙市'}, {'value': 430200, 'label': '株洲市'}, {'value': 430300, 'label': '湘潭市'}, {'value': 430400, 'label': '衡阳市'}, {'value': 430500, 'label': '邵阳市'}, {'value': 430600, 'label': '岳阳市'}, {'value': 430700, 'label': '常德市'}, {'value': 430800, 'label': '张家界市'}, {'value': 430900, 'label': '益阳市'}, {'value': 431000, 'label': '郴州市'}, {'value': 431100, 'label': '永州市'}, {'value': 431200, 'label': '怀化市'}, {'value': 431300, 'label': '娄底市'}, {'value': 433100, 'label': '湘西土家族苗族自治州'}]}, {'value': 440000, 'label': '广东省', 'children': [{'value': 440100, 'label': '广州市'}, {'value': 440200, 'label': '韶关市'}, {'value': 440300, 'label': '深圳市'}, {'value': 440400, 'label': '珠海市'}, {'value': 440500, 'label': '汕头市'}, {'value': 440600, 'label': '佛山市'}, {'value': 440700, 'label': '江门市'}, {'value': 440800, 'label': '湛江市'}, {'value': 440900, 'label': '茂名市'}, {'value': 441200, 'label': '肇庆市'}, {'value': 441300, 'label': '惠州市'}, {'value': 441400, 'label': '梅州市'}, {'value': 441500, 'label': '汕尾市'}, {'value': 441600, 'label': '河源市'}, {'value': 441700, 'label': '阳江市'}, {'value': 441800, 'label': '清远市'}, {'value': 441900, 'label': '东莞市'}, {'value': 442000, 'label': '中山市'}, {'value': 445100, 'label': '潮州市'}, {'value': 445200, 'label': '揭阳市'}, {'value': 445300, 'label': '云浮市'}]}, {'value': 450000, 'label': '广西自治区', 'children': [{'value': 450100, 'label': '南宁市'}, {'value': 450200, 'label': '柳州市'}, {'value': 450300, 'label': '桂林市'}, {'value': 450400, 'label': '梧州市'}, {'value': 450500, 'label': '北海市'}, {'value': 450600, 'label': '防城港市'}, {'value': 450700, 'label': '钦州市'}, {'value': 450800, 'label': '贵港市'}, {'value': 450900, 'label': '玉林市'}, {'value': 451000, 'label': '百色市'}, {'value': 451100, 'label': '贺州市'}, {'value': 451200, 'label': '河池市'}, {'value': 451300, 'label': '来宾市'}, {'value': 451400, 'label': '崇左市'}]}, {'value': 460000, 'label': '海南省', 'children': [{'value': 460100, 'label': '海口市'}, {'value': 460200, 'label': '三亚市'}, {'value': 460300, 'label': '三沙市'}, {'value': 460400, 'label': '儋州市'}, {'value': 469001, 'label': '五指山市'}, {'value': 469002, 'label': '琼海市'}, {'value': 469005, 'label': '文昌市'}, {'value': 469006, 'label': '万宁市'}, {'value': 469007, 'label': '东方市'}, {'value': 469021, 'label': '定安县'}, {'value': 469022, 'label': '屯昌县'}, {'value': 469023, 'label': '澄迈县'}, {'value': 469024, 'label': '临高县'}, {'value': 469025, 'label': '白沙黎族自治县'}, {'value': 469026, 'label': '昌江黎族自治县'}, {'value': 469027, 'label': '乐东黎族自治县'}, {'value': 469028, 'label': '陵水黎族自治县'}, {'value': 469029, 'label': '保亭黎族苗族自治县'}, {'value': 469030, 'label': '琼中黎族苗族自治县'}]}, {'value': 500000, 'label': '重庆市', 'children': [{'value': 500000, 'label': '重庆市'}]}, {'value': 510000, 'label': '四川省', 'children': [{'value': 510100, 'label': '成都市'}, {'value': 510300, 'label': '自贡市'}, {'value': 510400, 'label': '攀枝花市'}, {'value': 510500, 'label': '泸州市'}, {'value': 510600, 'label': '德阳市'}, {'value': 510700, 'label': '绵阳市'}, {'value': 510800, 'label': '广元市'}, {'value': 510900, 'label': '遂宁市'}, {'value': 511000, 'label': '内江市'}, {'value': 511100, 'label': '乐山市'}, {'value': 511300, 'label': '南充市'}, {'value': 511400, 'label': '眉山市'}, {'value': 511500, 'label': '宜宾市'}, {'value': 511600, 'label': '广安市'}, {'value': 511700, 'label': '达州市'}, {'value': 511800, 'label': '雅安市'}, {'value': 511900, 'label': '巴中市'}, {'value': 512000, 'label': '资阳市'}, {'value': 513200, 'label': '阿坝藏族羌族自治州'}, {'value': 513300, 'label': '甘孜藏族自治州'}, {'value': 513400, 'label': '凉山彝族自治州'}]}, {'value': 520000, 'label': '贵州省', 'children': [{'value': 520100, 'label': '贵阳市'}, {'value': 520200, 'label': '六盘水市'}, {'value': 520300, 'label': '遵义市'}, {'value': 520400, 'label': '安顺市'}, {'value': 520500, 'label': '毕节市'}, {'value': 520600, 'label': '铜仁市'}, {'value': 522300, 'label': '黔西南布依族苗族自治州'}, {'value': 522600, 'label': '黔东南苗族侗族自治州'}, {'value': 522700, 'label': '黔南布依族苗族自治州'}]}, {'value': 530000, 'label': '云南省', 'children': [{'value': 530100, 'label': '昆明市'}, {'value': 530300, 'label': '曲靖市'}, {'value': 530400, 'label': '玉溪市'}, {'value': 530500, 'label': '保山市'}, {'value': 530600, 'label': '昭通市'}, {'value': 530700, 'label': '丽江市'}, {'value': 530800, 'label': '普洱市'}, {'value': 530900, 'label': '临沧市'}, {'value': 532300, 'label': '楚雄彝族自治州'}, {'value': 532500, 'label': '红河哈尼族彝族自治州'}, {'value': 532600, 'label': '文山壮族苗族自治州'}, {'value': 532800, 'label': '西双版纳傣族自治州'}, {'value': 532900, 'label': '大理白族自治州'}, {'value': 533100, 'label': '德宏傣族景颇族自治州'}, {'value': 533300, 'label': '怒江傈僳族自治州'}, {'value': 533400, 'label': '迪庆藏族自治州'}]}, {'value': 540000, 'label': '西藏自治区', 'children': [{'value': 540100, 'label': '拉萨市'}, {'value': 540200, 'label': '日喀则市'}, {'value': 540300, 'label': '昌都市'}, {'value': 540400, 'label': '林芝市'}, {'value': 540500, 'label': '山南市'}, {'value': 540600, 'label': '那曲市'}, {'value': 542500, 'label': '阿里地区'}]}, {'value': 610000, 'label': '陕西省', 'children': [{'value': 610100, 'label': '西安市'}, {'value': 610200, 'label': '铜川市'}, {'value': 610300, 'label': '宝鸡市'}, {'value': 610400, 'label': '咸阳市'}, {'value': 610500, 'label': '渭南市'}, {'value': 610600, 'label': '延安市'}, {'value': 610700, 'label': '汉中市'}, {'value': 610800, 'label': '榆林市'}, {'value': 610900, 'label': '安康市'}, {'value': 611000, 'label': '商洛市'}]}, {'value': 620000, 'label': '甘肃省', 'children': [{'value': 620100, 'label': '兰州市'}, {'value': 620200, 'label': '嘉峪关市'}, {'value': 620300, 'label': '金昌市'}, {'value': 620400, 'label': '白银市'}, {'value': 620500, 'label': '天水市'}, {'value': 620600, 'label': '武威市'}, {'value': 620700, 'label': '张掖市'}, {'value': 620800, 'label': '平凉市'}, {'value': 620900, 'label': '酒泉市'}, {'value': 621000, 'label': '庆阳市'}, {'value': 621100, 'label': '定西市'}, {'value': 621200, 'label': '陇南市'}, {'value': 622900, 'label': '临夏回族自治州'}, {'value': 623000, 'label': '甘南藏族自治州'}]}, {'value': 630000, 'label': '青海省', 'children': [{'value': 630100, 'label': '西宁市'}, {'value': 630200, 'label': '海东市'}, {'value': 632200, 'label': '海北藏族自治州'}, {'value': 632300, 'label': '黄南藏族自治州'}, {'value': 632500, 'label': '海南藏族自治州'}, {'value': 632600, 'label': '果洛藏族自治州'}, {'value': 632700, 'label': '玉树藏族自治州'}, {'value': 632800, 'label': '海西蒙古族藏族自治州'}]}, {'value': 640000, 'label': '宁夏自治区', 'children': [{'value': 640100, 'label': '银川市'}, {'value': 640200, 'label': '石嘴山市'}, {'value': 640300, 'label': '吴忠市'}, {'value': 640400, 'label': '固原市'}, {'value': 640500, 'label': '中卫市'}]}, {'value': 650000, 'label': '新疆自治区', 'children': [{'value': 650100, 'label': '乌鲁木齐市'}, {'value': 650200, 'label': '克拉玛依市'}, {'value': 650400, 'label': '吐鲁番市'}, {'value': 650500, 'label': '哈密市'}, {'value': 652300, 'label': '昌吉回族自治州'}, {'value': 652700, 'label': '博尔塔拉蒙古自治州'}, {'value': 652800, 'label': '巴音郭楞蒙古自治州'}, {'value': 652900, 'label': '阿克苏地区'}, {'value': 653000, 'label': '克孜勒苏柯尔克孜自治州'}, {'value': 653100, 'label': '喀什地区'}, {'value': 653200, 'label': '和田地区'}, {'value': 654000, 'label': '伊犁哈萨克自治州'}, {'value': 654200, 'label': '塔城地区'}, {'value': 654300, 'label': '阿勒泰地区'}, {'value': 659001, 'label': '石河子市'}, {'value': 659002, 'label': '阿拉尔市'}, {'value': 659003, 'label': '图木舒克市'}, {'value': 659004, 'label': '五家渠市'}, {'value': 659005, 'label': '北屯市'}, {'value': 659006, 'label': '铁门关市'}, {'value': 659007, 'label': '双河市'}, {'value': 659008, 'label': '可克达拉市'}, {'value': 659009, 'label': '昆玉市'}]}, {'value': 710000, 'label': '台湾省', 'children': [{'value': 710000, 'label': '台湾省'}]}, {'value': 810000, 'label': '香港特别行政区', 'children': [{'value': 810000, 'label': '香港特别行政区'}]}, {'value': 820000, 'label': '澳门特别行政区', 'children': [{'value': 820000, 'label': '澳门特别行政区'}]}]
    };
  },
  mounted() {
    this.$axios.post('http://116.62.153.183/getChinaEpidemicDataByDate', {date: this.getDay(-1)}).then(res => {
      let msg = res.data.msg;

      for (let i = 0; i < msg.length; i++) {
        let word = msg[i].provinceName.replace("省", "")
        word = word.replace("市", "")
        word = word.replace("特别行政区", "")
        word = word.replace("自治区", "")
        let a = {name: word, stuNum: msg[i].nowConfirm}
        this.dataProvince.push(a)
      }
      this.drawPopOut()
      this.chinaConfigure();
    }
    )

  },
  beforeDestroy() {
    if (!this.chart) {
      return;
    }
    this.chart.dispose();
    this.chart = null;
  },
  methods: {
    doHandleMonth(month) {
      var m = month;
      if (month.toString().length == 1) {
        m = "0" + month;
      }
      return m;
    },
    getDay(day) {
      var today = new Date();
      var targetday_milliseconds = today.getTime() + 1000 * 60 * 60 * 24 * day;
      today.setTime(targetday_milliseconds); //注意，这行是关键代码

      var tYear = today.getFullYear();
      var tMonth = today.getMonth();
      var tDate = today.getDate();
      tMonth = this.doHandleMonth(tMonth + 1);
      tDate = this.doHandleMonth(tDate);
      return tYear + "-" + tMonth + "-" + tDate;
    },
    drawPopOut(){
      var newconfig={data:[]}

      this.bjData=[]
      let config = {
        headers: {
          'Content-Type': 'application/json'
        }
      }
      this.$axios.post('http://116.62.153.183/getPopulationOutByCityId', {"cityId":this.value1[1]},config).then(res => {
        let msg = res.data.msg;
        let city=""
        for (let i = 0; i < msg.length; i++) {
          city=msg[i].city
          let a=[{name:msg[i].city.replace("市","")},{name:msg[i].toCity.replace("市","")}]
          let b={name:msg[i].toCity.replace("市",""),value:msg[i].populationOut}
          newconfig.data.push(b)
          this.bjData.push(a)
        }


        this.chinaConfigure()
        this.title=city+"人口流出top10"
        this.listConfig=newconfig
        this.value2=[]
        this.analysis="暂无信息"
      })

    },drawPopIn(){
      var newconfig={data:[]}
      this.bjData=[]
      let config = {
        headers: {
          'Content-Type': 'application/json'
        }
      }
      this.$axios.post('http://116.62.153.183/getPopulationInByCityId', {"cityId":this.value2[1]},config).then(res => {
        let msg = res.data.msg;
        let city=""
        for (let i = 0; i < msg.length; i++) {
          city=msg[i].city
          let a=[{name:msg[i].fromCity.replace("市","")},{name:msg[i].city.replace("市","")}]
          this.bjData.push(a)
          let b={name:msg[i].fromCity.replace("市",""),value:msg[i].populationIn}
          newconfig.data.push(b)
        }
        this.value1=[]
        this.chinaConfigure()
        this.title=city+"人口流入top10"
        this.listConfig=newconfig
      })
      this.$axios.post('http://116.62.153.183/getPopulationAnalysis', {"cityId":this.value2[1]},config).then(res => {
        let resu = res.data.msg
            this.analysis = resu
          }
      )

    },
    goBack() {
      router.push('/')
    },
    chinaConfigure() {
      var mapName = "china";

      var geoCoordMap = {
        阿克苏地区: [80.260604, 41.168779],
        和田地区: [79.922211, 37.114157],
        上海: [121.480237, 31.236305],
        东莞: [113.758231, 23.026997],
        东营: [118.588614, 37.454925],
        中山: [113.399023, 22.522262],
        临汾: [111.526153, 36.094052],
        临沂: [118.36299, 35.110531],
        丹东: [124.362564, 40.00569],
        丽水: [119.929503, 28.472979],
        乌鲁木齐: [87.623314, 43.832806],
        佛山: [113.128432, 23.027707],
        保定: [115.471052, 38.880055],
        兰州: [103.840692, 36.067312],
        包头: [109.846755, 40.663636],
        北京: [116.413554, 39.911013],
        北海: [109.126614, 21.486955],
        南京: [118.802891, 32.064735],
        南宁: [108.373351, 22.823037],
        南昌: [115.864528, 28.687675],
        南通: [120.900301, 31.985237],
        厦门: [118.095915, 24.485821],
        台州: [121.426996, 28.662297],
        合肥: [117.235447, 31.82687],
        呼和浩特: [111.758518, 40.847461],
        咸阳: [108.715712, 34.335599],
        哈尔滨: [126.542417, 45.807782],
        唐山: [118.187036, 39.636673],
        嘉兴: [120.762045, 30.750912],
        大同: [113.306446, 40.082539],
        大连: [121.621391, 38.919345],
        天津: [117.205914, 39.090908],
        太原: [112.55706, 37.876885],
        威海: [122.128245, 37.519322],
        宁波: [121.556686, 29.880177],
        宝鸡: [107.243899, 34.367747],
        宿迁: [118.282062, 33.967686],
        常州: [119.980142, 31.816791],
        广州: [113.270793, 23.135308],
        廊坊: [116.69034, 39.54352],
        延安: [109.496361, 36.591003],
        张家口: [114.894165, 40.830172],
        徐州: [117.29235, 34.210143],
        德州: [116.365825, 37.441313],
        惠州: [114.423348, 23.116409],
        成都: [104.071216, 30.576279],
        扬州: [119.419107, 32.39986],
        承德: [117.969798, 40.957855],
        拉萨: [91.121025, 29.650088],
        无锡: [120.318954, 31.496704],
        日照: [119.533606, 35.422798],
        昆明: [102.839667, 24.885953],
        杭州: [120.161693, 30.280059],
        枣庄: [117.328513, 34.816569],
        柳州: [109.42198, 24.331519],
        株洲: [113.140431, 27.833737],
        武汉: [114.311831, 30.598428],
        汕头: [116.688739, 23.359289],
        江门: [113.088165, 22.584459],
        沈阳: [123.438973, 41.811339],
        沧州: [116.845272, 38.31022],
        河源: [114.707097, 23.749829],
        泉州: [118.682316, 24.880242],
        泰安: [117.094893, 36.205905],
        泰州: [119.932115, 32.4612],
        济南: [117.001319, 36.671627],
        济宁: [116.593852, 35.420269],
        海口: [110.206424, 20.050057],
        淄博: [118.061254, 36.819182],
        淮安: [119.022429, 33.616272],
        深圳: [114.066112, 22.548515],
        清远: [113.062619, 23.688238],
        温州: [120.705869, 28.001095],
        渭南: [109.516739, 34.505687],
        湖州: [120.094566, 30.899015],
        湘潭: [112.950575, 27.83585],
        滨州: [117.9792, 37.388387],
        潍坊: [119.168138, 36.713212],
        烟台: [121.454425, 37.469868],
        玉溪: [102.5537, 24.357512],
        珠海: [113.583235, 22.276392],
        盐城: [120.168187, 33.355301],
        盘锦: [122.077269, 41.125939],
        石家庄: [114.520828, 38.048684],
        福州: [119.302938, 26.080447],
        秦皇岛: [119.606184, 39.941259],
        绍兴: [120.586673, 30.036519],
        聊城: [115.992077, 36.462681],
        肇庆: [112.47177, 23.052984],
        舟山: [122.214339, 29.991092],
        苏州: [120.589613, 31.304566],
        莱芜: [117.683221, 36.219357],
        菏泽: [115.487696, 35.239435],
        营口: [122.241475, 40.672565],
        葫芦岛: [120.843388, 40.717364],
        衡水: [115.676942, 37.745166],
        衢州: [118.880768, 28.941661],
        西宁: [101.784269, 36.623477],
        西安: [108.946306, 34.347436],
        贵阳: [106.636816, 26.652747],
        连云港: [119.229571, 34.602342],
        邢台: [114.510889, 37.076646],
        邯郸: [114.545808, 36.631222],
        郑州: [113.631349, 34.753488],
        鄂尔多斯: [109.787314, 39.61463],
        重庆: [106.557165, 29.570997],
        金华: [119.654027, 29.084455],
        铜川: [108.951558, 34.902957],
        银川: [106.238976, 38.492392],
        镇江: [119.431494, 32.195688],
        长春: [125.33017, 43.82178],
        长沙: [112.945333, 28.233971],
        长治: [113.123046, 36.201585],
        阳泉: [113.587087, 37.86234],
        青岛: [120.389445, 36.072358],
        韶关: [113.603757, 24.816174],
        九江: [116.007993, 29.711328],
        大庆: [125.109727, 46.593216],
        宁德: [119.554701, 26.671748],
        忻州: [112.740804, 38.422382],
        石嘴山: [106.39078, 38.989783],
        池州: [117.497839, 30.67098],
        淮南: [117.006189, 32.631837],
        吐鲁番地区: [89.196029, 42.957303],
        宜昌: [111.292971, 30.697602],
        景德镇: [117.184967, 29.274337],
        安庆: [117.070127, 30.548594],
        怒江傈僳族自治州: [98.863189, 25.823736],
        白城: [122.845302, 45.6254],
        萍乡: [113.86077, 27.62897],
        抚州: [116.364627, 27.953603],
        朝阳: [120.457301, 41.579487],
        海东: [102.003965, 36.406412],
        湘西土家族苗族自治州: [109.745507, 28.317399],
        鹰潭: [117.075765, 28.265879],
        阿拉善盟: [105.735357, 38.857806],
        大阪府: [0, 0],
        鹤岗: [130.304284, 47.356043],
        吴忠: [106.205161, 38.003863],
        石河子: [86.085507, 44.312423],
        开封: [114.313904, 34.802941],
        延边朝鲜族自治州: [129.515602, 42.897211],
        白银: [104.144182, 36.550821],
        吕梁: [111.148086, 37.525476],
        随州: [113.389071, 31.696341],
        雅安: [103.04636, 30.021277],
        平顶山: [113.198935, 33.772051],
        阜新: [121.676518, 42.027983],
        普洱: [100.98114, 22.788486],
        三亚: [109.518646, 18.258217],
        赣州: [114.94126, 25.837179],
        广元: [105.849993, 32.441808],
        锦州: [121.133631, 41.100869],
        南充: [106.117231, 30.843297],
        衡阳: [112.578397, 26.899517],
        齐齐哈尔: [123.924531, 47.360087],
        兴安盟: [122.044544, 46.088444],
        乌海: [106.80185, 39.660154],
        楚雄彝族自治州: [101.534082, 25.051226],
        伊春: [128.84704, 47.733329],
        陇南: [104.928233, 33.406825],
        荆门: [112.205843, 31.041792],
        辽源: [125.150107, 42.8943],
        怀化: [110.008116, 27.575595],
        牡丹江: [129.638976, 44.558647],
        黄南藏族自治州: [102.021495, 35.526125],
        湛江: [110.365494, 21.277163],
        天水: [105.731276, 34.587162],
        黔东南苗族侗族自治州: [107.990602, 26.589858],
        云浮: [112.051045, 22.921154],
        安康: [109.03592, 32.690575],
        日喀则地区: [88.956063, 29.26816],
        海北藏族自治州: [100.907395, 36.960702],
        海西蒙古族藏族自治州: [97.377823, 37.382839],
        吉安: [115.00027, 27.119751],
        黄石: [115.045433, 30.205336],
        宿州: [116.970454, 33.652034],
        茂名: [110.931773, 21.669051],
        阳江: [111.989051, 21.864421],
        信阳: [114.099264, 32.153186],
        三门峡: [111.206832, 34.778442],
        咸宁: [114.328967, 29.847123],
        许昌: [113.858804, 34.041737],
        保山: [99.168373, 25.117882],
        鹤壁: [114.304044, 35.752656],
        运城: [111.013379, 35.032587],
        达州: [107.474504, 31.214347],
        常德: [111.704994, 29.037723],
        酒泉: [98.500427, 39.738615],
        马鞍山: [118.512691, 31.67633],
        南阳: [112.535009, 32.996701],
        邵阳: [111.474133, 27.245167],
        黔南布依族苗族自治州: [107.528663, 26.260586],
        孝感: [113.922962, 30.930712],
        安顺: [105.952622, 26.259904],
        辽阳: [123.243726, 41.274452],
        黔西南布依族苗族自治州: [104.910858, 25.095974],
        克拉玛依: [84.89587, 45.585765],
        庆阳: [107.649305, 35.716096],
        呼伦贝尔: [119.77221, 49.217977],
        六盘水: [104.836786, 26.599086],
        新余: [114.923664, 27.823541],
        七台河: [131.009618, 45.776512],
        商丘: [115.662798, 34.420378],
        漯河: [114.02323, 33.587703],
        乌兰察布: [113.140223, 40.999972],
        潜江: [112.905773, 30.407633],
        定西: [104.631662, 35.587354],
        鸡西: [130.976161, 45.300906],
        汕尾: [115.381693, 22.791322],
        四平: [124.356844, 43.172447],
        西双版纳傣族自治州: [100.803836, 22.013792],
        遂宁: [105.599152, 30.539156],
        商洛: [109.94688, 33.876525],
        海南藏族自治州: [100.626831, 36.292132],
        文山壮族苗族自治州: [104.221606, 23.404187],
        六安: [116.529651, 31.741226],
        张家界: [110.484925, 29.122477],
        潮州: [116.62943, 23.662923],
        蚌埠: [117.395835, 32.921498],
        桂林: [110.296442, 25.279893],
        甘南藏族自治州: [102.917605, 34.98901],
        驻马店: [114.029465, 33.017546],
        林芝地区: [94.368109, 29.654792],
        百色: [106.624969, 23.907845],
        鞍山: [123.000974, 41.114122],
        郴州: [113.021311, 25.776711],
        巴中: [106.753912, 31.872851],
        恩施土家族苗族自治州: [109.494763, 30.277908],
        十堰: [110.80454, 32.635042],
        临沧: [100.10566, 23.914336],
        泸州: [105.449092, 28.877577],
        平凉: [106.671741, 35.549266],
        宣城: [118.765196, 30.946576],
        绵阳: [104.686164, 31.473364],
        佳木斯: [130.32696, 46.806581],
        遵义: [106.933658, 27.731749],
        钦州: [108.66089, 21.985392],
        玉树藏族自治州: [97.01308, 33.011061],
        本溪: [123.773468, 41.299847],
        朔州: [112.438184, 39.33789],
        毕节: [105.333323, 27.408562],
        张掖: [100.456221, 38.932187],
        南平: [118.1843, 26.647662],
        濮阳: [115.035917, 35.767586],
        宜宾: [104.648103, 28.75761],
        铜仁: [109.168558, 27.674903],
        松原: [124.831633, 45.147201],
        漳州: [117.653827, 24.519197],
        梧州: [111.285647, 23.482873],
        洛阳: [112.460033, 34.624376],
        龙岩: [117.023668, 25.081257],
        莆田: [119.014232, 25.45996],
        济源: [112.609314, 35.072867],
        哈密地区: [93.522785, 42.824642],
        昭通: [103.723311, 27.344057],
        大理白族自治州: [100.274223, 25.612206],
        昌吉回族自治州: [87.314822, 44.016923],
        迪庆藏族自治州: [99.70948, 27.825264],
        黑河: [127.535014, 50.251193],
        吉林: [126.556073, 43.843512],
        广安: [106.639772, 30.461708],
        黄山: [118.174807, 30.133213],
        德阳: [104.404319, 31.133105],
        河池: [108.091898, 24.698828],
        益阳: [112.361677, 28.559818],
        通化: [125.946506, 41.733906],
        永州: [111.618703, 26.426612],
        周口: [114.703433, 33.631958],
        梅州: [116.129179, 24.294311],
        锡林郭勒盟: [116.054141, 43.939525],
        固原: [106.24917, 36.021609],
        滁州: [118.323252, 32.308165],
        荆州: [112.24722, 30.340606],
        芜湖: [118.439561, 31.358798],
        襄阳: [112.250093, 32.229169],
        吉隆坡: [0, 0],
        榆林: [109.741195, 38.290886],
        果洛藏族自治州: [100.251341, 34.477207],
        玉林: [110.18743, 22.660656],
        临夏回族自治州: [103.217303, 35.607475],
        鄂州: [114.901557, 30.396522],
        晋中: [112.759375, 37.692757],
        巴音郭楞蒙古自治州: [86.151584, 41.770226],
        澳门: [113.549403, 22.192961],
        内江: [105.065028, 29.585836],
        揭阳: [116.37922, 23.555773],
        通辽: [122.251207, 43.658363],
        阜阳: [115.821389, 32.895879],
        中卫: [105.203332, 37.506058],
        铜陵: [117.818795, 30.950899],
        红河哈尼族彝族自治州: [103.38215, 23.369914],
        曲靖: [103.802685, 25.496328],
        香港: [114.171994, 22.281089],
        汉中: [107.030197, 33.07382],
        乐山: [103.77193, 29.558141],
        新乡: [113.933349, 35.308973],
        晋城: [112.857706, 35.496081],
        巴彦淖尔: [107.394129, 40.749427],
        武威: [102.644524, 37.934078],
        岳阳: [113.135679, 29.363262],
        赤峰: [118.895463, 42.264586],
        白山: [126.431052, 41.94643],
        攀枝花: [101.725262, 26.588109],
        黄冈: [114.878872, 30.459422],
        绥化: [126.975678, 46.658789],
        双鸭山: [131.165442, 46.652966],
        凉山彝族自治州: [102.273965, 27.887685],
        伊犁哈萨克自治州: [81.330697, 43.922815],
        德宏傣族景颇族自治州: [98.591419, 24.438031],
        安阳: [114.3996, 36.103649],
        三明: [117.645742, 26.269683],
        宜春: [114.422683, 27.820089],
        上饶: [117.950028, 28.460864],
        自贡: [104.784891, 29.345379],
        娄底: [112.001082, 27.703196],
        丽江: [100.23357, 26.862521],
        防城港: [108.361138, 21.693439],
        淮北: [116.804878, 33.96064],
        儋州: [109.587145, 19.527081],
        怒江州: [98.863189, 25.823736],
        焦作: [113.248557, 35.221493],
        铁岭: [123.848797, 42.292573],
        抚顺: [123.963595, 41.886078],
        巢湖: [117.88049, 31.608733],
        西双版纳: [100.803836, 22.013792],
        德宏州: [98.591419, 24.438031],
        恩施: [109.485727, 30.30089],
        湘西州: [109.745507, 28.317399],
        西昌: [102.269526, 27.900601],
        阿坝州: [102.231186, 31.905609],
        黔南州: [107.528663, 26.260586],
        黔东南州: [107.990602, 26.589858],
        黔西南州: [104.910858, 25.095974],
        大理州: [100.274223, 25.612206],
        红河州: [103.38215, 23.369914],
        文山州: [104.221606, 23.404187],
        楚雄州: [101.534082, 25.051226],
        迪庆州: [99.70948, 27.825264],
        山南地区: [91.779601, 29.24309],
        那曲地区: [92.0578, 31.482375],
        博尔塔拉蒙古自治州: [82.073064, 44.912168],
        临夏州: [103.217303, 35.607475],
        甘南州: [102.917605, 34.98901],
        格尔木: [94.909745, 36.408588],
        奎屯: [84.90832, 44.432645],
        亳州: [115.7786, 33.8445],
        崇左: [107.3647, 22.3765],
        定安县: [110.3588, 19.6814],
        东方: [108.6518, 19.0953],
        贵港: [109.5989, 23.1115],
        贺州: [111.5666, 24.4035],
        嘉峪关: [98.2891, 39.7731],
        金昌: [102.1880, 38.5200],
        来宾: [109.2214, 23.7503],
        乐东黎族自治县: [109.1730, 18.7502],
        陵水黎族自治县: [110.0375, 18.5060],
        眉山: [103.8485, 30.0754],
        琼海: [110.4921, 19.2396],
        台湾: [120.9605, 23.6978],
        天门: [113.3169, 30.8657],
        屯昌县: [110.1034, 19.3517],
        万宁: [110.3816, 18.8078],
        文昌: [113.8259, 25.8228],
        五指山: [109.5169, 18.7751],
        仙桃: [113.4234, 30.3608],
        资阳: [104.6520, 30.1246],
        安徽: [117.17, 31.52],
        福建: [119.18, 26.05],
        甘肃: [103.51, 36.04],
        广东: [113.14, 23.08],
        广西: [108.19, 22.48],
        贵州: [106.42, 26.35],
        海南: [110.20, 20.02],
        河北: [114.30, 38.02],
        河南: [113.40, 34.46],
        黑龙江: [126.36, 45.44],
        湖北: [114.17, 30.35],
        湖南: [112.59, 28.12],
        江苏: [118.46, 32.03],
        江西: [115.55, 28.40],
        辽宁: [123.25, 41.48],
        内蒙古: [111.41, 40.48],
        宁夏: [106.16, 38.27],
        青海: [101.48, 36.38],
        山东: [117.00, 36.40],
        山西: [112.33, 37.54],
        陕西: [108.57, 34.17],
        四川: [104.04, 30.40],
        西藏: [91.08, 29.39],
        新疆: [87.36, 43.45],
        云南: [102.42, 25.04],
        浙江: [120.10, 30.16],
      }
      let convert = data => {
        let res = [];
        for (var i = 0; i < data.length; i++) {
          var dataItem = data[i];
          var fromCoord = geoCoordMap[dataItem[0].name];
          var toCoord = geoCoordMap[dataItem[1].name];
          if (fromCoord && toCoord) {
            res.push({
              fromName: dataItem[0].name,
              toName: dataItem[1].name,
              coords: [fromCoord, toCoord]
            });
          }
        }

        return res;
      };

      /*获取地图数据*/

       this.myChart = echarts.init(this.$refs.echartsMap);
      var option = {
        tooltip: {
          show: true,
          padding: 0,
          enterable: true,
          transitionDuration: 1,
          backgroundColor: "", // 背景
          textStyle: {
            color: "#000",
            decoration: "none"
          }
        },
        grid: { top: 10 },
        geo: {
          show: true,
          map: mapName,
          zoom: 1.2,
          label: {
            normal: {
              show: false
            },
            emphasis: {
              show: false
            }
          },
          roam: false,
          itemStyle: {
            //地图样式
            normal: {
              borderColor: "#44B2EA",
              borderWidth: 2,
              areaColor: "#15294f",
              shadowColor: "#0A41C8",
              shadowOffsetX: 2,
              shadowOffsetY: 4,
              shadowBlur: 4
            }
          }
        },
        series: [
          {
            type: "map",
            map: mapName,
            geoIndex: 3,
            zoom: 1.2,
            showLegendSymbol: false, // 存在legend时显示
            label: {
              normal: {
                show: true,
                textStyle: {
                  color: "#fff"
                }
              },
              emphasis: {
                show: true,
                textStyle: {
                  color: "#fff"
                }
              }
            },
            roam: false,
            itemStyle: {
              normal: {
                areaColor: "#04122d",
                borderColor: "#44B2EA",
                borderWidth: 1
              },
              emphasis: {
                areaColor: "#44B2EA",
                borderColor: "#ffffff",
                borderWidth: 1
              }
            },
            tooltip: {
              trigger: "item",
              // position: ['50%', '50%'],
              formatter: function(params) {
                let tipHtml =
                    '<div style="width:180px;height:150px;background:rgba(22,80,158,0.8);border:1px solid rgba(7,166,255,0.7)">' +
                    '<div style="width:100%;height:40px;line-height:40px;border-bottom:2px solid rgba(7,166,255,0.7);padding:0 10px">' +
                    '<i style="display:inline-block;width:8px;height:8px;background:#16d6ff;border-radius:40px;">' +
                    "</i>" +
                    '<span style="margin-left:10px;color:#fff;font-size:16px;">' +
                    params.name +
                    "</span>" +
                    "</div>" +
                    '<div style="padding:10px">' +
                    '<p style="color:#fff;font-size:12px;">' +
                    '<i style="display:inline-block;width:10px;height:10px;background:#16d6ff;border-radius:40px;margin:0 4px">' +
                    "</i>" +
                    "当前确诊人数：" +
                    '<span style="color:#44b5be;margin:0 6px;">' +
                    params.data.stuNum +
                    "</span>" +
                    "人" +
                    "</p>" +
                    "</div>" +
                    "</div>";
                return tipHtml;
              }
            },
            animation: true,
            data: this.dataProvince
          },
          {
            type: "lines",
            zlevel: 10,
            symbol: ["none"],
            symbolSize: 10,
            lineStyle: {
              normal: {
                color: {
                  type: "linear",
                  x: 0,
                  y: 1,
                  x2: 1,
                  y2: 0,
                  colorStops: [
                    {
                      offset: 0,
                      color: "rgb(76,199,216)" // 0% 处的颜色
                    },
                    {
                      offset: 0.5,
                      color: "rgb(17,238,205)" // 100% 处的颜色
                    },
                    {
                      offset: 1,
                      color: "rgb(76,199,216)" // 0% 处的颜色
                    }
                  ],
                  global: false // 缺省为 false
                },
                width: 0.5,
                opacity: 1,
                curveness: 0.3
              }
            },
            effect: {
              show: true,
              symbolSize: "10",
              period: "6",
              symbol: "pin",
              color: "#fff",
              trailLength: "0.5"
            },
            data: convert(this.bjData),
            tooltip: {
              show: false
            }
          }
        ]
      };
      this.myChart.setOption(option);
    }
  }
};
</script>
<style lang="scss" scoped>
.box {
  width: 90%;
  height: 90%;
}
.pc-sel-area-cascader {
  // 选择面板样式
  .el-calendar__body{
    color: #ffffff;
  }
  .el-cascader-menu{
    color: #ffffff;
  }
  .el-cascader-panel {
    width: 360px;
    background-color: rgb(6, 20, 83);
  }
  .el-cascader-menu__wrap {
    // 设置选择器省市区分块面板高度
    height: 305px;
  }
  .el-cascader-menu {
    // 省市区分块右边框
    border: none;
  }
  .el-scrollbar__thumb {
    // 上下滚动条
    display: none;
  }
  .el-cascader-node {
    height: 40px;
  }

  .el-cascader-node:hover {
    // 设置鼠标滑过时文字颜色
    color: #170606;
  }
  // 文字选中样式及span背景颜色
  .el-cascader-node.in-active-path,
  .el-cascader-node.is-active,
  .el-cascader-node.is-selectable.in-checked-path {
    font-style: unset;
    color: #4cc7d8;
  }
  .el-cascader-node__label {
    // 设置文字样式
    padding: 0 7px;
    font-size: 14px;
    font-family: PingFangSC-Regular, PingFang SC;
    font-weight: 400;
    //color:white;
  }


  .el-icon-check {
    // 去掉选中小对勾
    display:grid;
  }
  .el-icon-arrow-right {
    // 选项去掉右侧小图标
    display: grid;
  }
  // 选择器面板边框及圆角设置
  border-radius: 12px !important;
  border: 3px solid #5e768d !important;
  box-shadow: 0px 10px 40px 0px rgba(66, 46, 46, 0.29) !important;


}
.pc-sel-area-cascader[x-placement^='bottom'] {
  // 选择器面板与输入框的距离
  margin-top: 5px !important;
}
.pc-sel-area-cascader[x-placement^='bottom'] .popper__arrow {
  // 输入框下面小三角形
  display: flex;
}
.select_btn{
  // position: absolute;
  top: 5px;
  right: 60px;
  //下拉框
  .el-select-dropdown{
    border: none;
    background-color: rgba(1, 28, 82, 0.8);
  }
  //输入框
  .el-input__inner{
    color:#eee;
    border-color: #00fff6;
    background-color: rgba(1, 28, 82, 0.8);
  }
  //聚焦时的样式
  .el-select .el-input.is-focus .el-input__inner{
    border-color: #0B61AA;
    background-color: rgba(1, 28, 82, 0.8);
    color:#00D3E9;
  }
  //下拉框选中
  .el-select-dropdown__item{
    color: #eee;
  }
  //鼠标经过下拉框
  .el-select-dropdown__item.hover,
  .el-select-dropdown__item:hover{
    color:#00D3E9;
    background-color: #0F3360;
  }
}
</style>